epsilonrt/esp32c6-cn-package/package/boards.txt
##############################################################

makergo_c6_supermini.name=MakerGO ESP32 C6 SuperMini

makergo_c6_supermini.bootloader.tool=esptool_py
makergo_c6_supermini.bootloader.tool.default=esptool_py

makergo_c6_supermini.upload.tool=esptool_py
makergo_c6_supermini.upload.tool.default=esptool_py
makergo_c6_supermini.upload.tool.network=esp_ota

makergo_c6_supermini.upload.maximum_size=1310720
makergo_c6_supermini.upload.maximum_data_size=327680
makergo_c6_supermini.upload.flags=
makergo_c6_supermini.upload.extra_flags=
makergo_c6_supermini.upload.use_1200bps_touch=false
makergo_c6_supermini.upload.wait_for_upload_port=false

makergo_c6_supermini.serial.disableDTR=false
makergo_c6_supermini.serial.disableRTS=false

makergo_c6_supermini.build.tarch=riscv32
makergo_c6_supermini.build.target=esp
makergo_c6_supermini.build.mcu=esp32c6
makergo_c6_supermini.build.core=esp32:esp32
makergo_c6_supermini.build.variant=makergo_c6_supermini
makergo_c6_supermini.build.board=ESP32C6_DEV
makergo_c6_supermini.build.bootloader_addr=0x0

makergo_c6_supermini.build.cdc_on_boot=0
makergo_c6_supermini.build.f_cpu=160000000L
makergo_c6_supermini.build.flash_size=4MB
makergo_c6_supermini.build.flash_freq=80m
makergo_c6_supermini.build.flash_mode=qio
makergo_c6_supermini.build.boot=qio
makergo_c6_supermini.build.partitions=default
makergo_c6_supermini.build.defines=

## IDE 2.0 Seems to not update the value
makergo_c6_supermini.menu.JTAGAdapter.default=Disabled
makergo_c6_supermini.menu.JTAGAdapter.default.build.copy_jtag_files=0
makergo_c6_supermini.menu.JTAGAdapter.builtin=Integrated USB JTAG
makergo_c6_supermini.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
makergo_c6_supermini.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
makergo_c6_supermini.menu.JTAGAdapter.external=FTDI Adapter
makergo_c6_supermini.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
makergo_c6_supermini.menu.JTAGAdapter.external.build.copy_jtag_files=1
makergo_c6_supermini.menu.JTAGAdapter.bridge=ESP USB Bridge
makergo_c6_supermini.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
makergo_c6_supermini.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

makergo_c6_supermini.menu.CDCOnBoot.default=Disabled
makergo_c6_supermini.menu.CDCOnBoot.default.build.cdc_on_boot=0
makergo_c6_supermini.menu.CDCOnBoot.cdc=Enabled
makergo_c6_supermini.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

makergo_c6_supermini.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
makergo_c6_supermini.menu.PartitionScheme.default.build.partitions=default
makergo_c6_supermini.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
makergo_c6_supermini.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
makergo_c6_supermini.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
makergo_c6_supermini.menu.PartitionScheme.minimal.build.partitions=minimal
makergo_c6_supermini.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
makergo_c6_supermini.menu.PartitionScheme.no_ota.build.partitions=no_ota
makergo_c6_supermini.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
makergo_c6_supermini.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
makergo_c6_supermini.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
makergo_c6_supermini.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
makergo_c6_supermini.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
makergo_c6_supermini.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
makergo_c6_supermini.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
makergo_c6_supermini.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
makergo_c6_supermini.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
makergo_c6_supermini.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
makergo_c6_supermini.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
makergo_c6_supermini.menu.PartitionScheme.huge_app.build.partitions=huge_app
makergo_c6_supermini.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
makergo_c6_supermini.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
makergo_c6_supermini.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
makergo_c6_supermini.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
makergo_c6_supermini.menu.PartitionScheme.rainmaker=RainMaker 4MB
makergo_c6_supermini.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
makergo_c6_supermini.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
makergo_c6_supermini.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
makergo_c6_supermini.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
makergo_c6_supermini.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
makergo_c6_supermini.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
makergo_c6_supermini.menu.PartitionScheme.zigbee.build.partitions=zigbee
makergo_c6_supermini.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
makergo_c6_supermini.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
makergo_c6_supermini.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
makergo_c6_supermini.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
makergo_c6_supermini.menu.PartitionScheme.custom=Custom
makergo_c6_supermini.menu.PartitionScheme.custom.build.partitions=
makergo_c6_supermini.menu.PartitionScheme.custom.upload.maximum_size=4194304

makergo_c6_supermini.menu.CPUFreq.160=160MHz (WiFi)
makergo_c6_supermini.menu.CPUFreq.160.build.f_cpu=160000000L
makergo_c6_supermini.menu.CPUFreq.80=80MHz (WiFi)
makergo_c6_supermini.menu.CPUFreq.80.build.f_cpu=80000000L
makergo_c6_supermini.menu.CPUFreq.40=40MHz
makergo_c6_supermini.menu.CPUFreq.40.build.f_cpu=40000000L
makergo_c6_supermini.menu.CPUFreq.20=20MHz
makergo_c6_supermini.menu.CPUFreq.20.build.f_cpu=20000000L
makergo_c6_supermini.menu.CPUFreq.10=10MHz
makergo_c6_supermini.menu.CPUFreq.10.build.f_cpu=10000000L

