epsilonrt/esp32c6-cn-package/package/boards.txt
makergo_c6_supermini.menu.FlashMode.qio=QIO
makergo_c6_supermini.menu.FlashMode.qio.build.flash_mode=dio
makergo_c6_supermini.menu.FlashMode.qio.build.boot=qio
makergo_c6_supermini.menu.FlashMode.dio=DIO
makergo_c6_supermini.menu.FlashMode.dio.build.flash_mode=dio
makergo_c6_supermini.menu.FlashMode.dio.build.boot=dio

makergo_c6_supermini.menu.FlashFreq.80=80MHz
makergo_c6_supermini.menu.FlashFreq.80.build.flash_freq=80m
makergo_c6_supermini.menu.FlashFreq.40=40MHz
makergo_c6_supermini.menu.FlashFreq.40.build.flash_freq=40m

makergo_c6_supermini.menu.FlashSize.4M=4MB (32Mb)
makergo_c6_supermini.menu.FlashSize.4M.build.flash_size=4MB

makergo_c6_supermini.menu.UploadSpeed.921600=921600
makergo_c6_supermini.menu.UploadSpeed.921600.upload.speed=921600
makergo_c6_supermini.menu.UploadSpeed.115200=115200
makergo_c6_supermini.menu.UploadSpeed.115200.upload.speed=115200
makergo_c6_supermini.menu.UploadSpeed.256000.windows=256000
makergo_c6_supermini.menu.UploadSpeed.256000.upload.speed=256000
makergo_c6_supermini.menu.UploadSpeed.230400.windows.upload.speed=256000
makergo_c6_supermini.menu.UploadSpeed.230400=230400
makergo_c6_supermini.menu.UploadSpeed.230400.upload.speed=230400
makergo_c6_supermini.menu.UploadSpeed.460800.linux=460800
makergo_c6_supermini.menu.UploadSpeed.460800.macosx=460800
makergo_c6_supermini.menu.UploadSpeed.460800.upload.speed=460800
makergo_c6_supermini.menu.UploadSpeed.512000.windows=512000
makergo_c6_supermini.menu.UploadSpeed.512000.upload.speed=512000

makergo_c6_supermini.menu.DebugLevel.none=None
makergo_c6_supermini.menu.DebugLevel.none.build.code_debug=0
makergo_c6_supermini.menu.DebugLevel.error=Error
makergo_c6_supermini.menu.DebugLevel.error.build.code_debug=1
makergo_c6_supermini.menu.DebugLevel.warn=Warn
makergo_c6_supermini.menu.DebugLevel.warn.build.code_debug=2
makergo_c6_supermini.menu.DebugLevel.info=Info
makergo_c6_supermini.menu.DebugLevel.info.build.code_debug=3
makergo_c6_supermini.menu.DebugLevel.debug=Debug
makergo_c6_supermini.menu.DebugLevel.debug.build.code_debug=4
makergo_c6_supermini.menu.DebugLevel.verbose=Verbose
makergo_c6_supermini.menu.DebugLevel.verbose.build.code_debug=5

makergo_c6_supermini.menu.EraseFlash.none=Disabled
makergo_c6_supermini.menu.EraseFlash.none.upload.erase_cmd=
makergo_c6_supermini.menu.EraseFlash.all=Enabled
makergo_c6_supermini.menu.EraseFlash.all.upload.erase_cmd=-e

makergo_c6_supermini.menu.ZigbeeMode.default=Disabled
makergo_c6_supermini.menu.ZigbeeMode.default.build.zigbee_mode=
makergo_c6_supermini.menu.ZigbeeMode.default.build.zigbee_libs=
makergo_c6_supermini.menu.ZigbeeMode.ed=Zigbee ED (end device)
makergo_c6_supermini.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
makergo_c6_supermini.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
makergo_c6_supermini.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
makergo_c6_supermini.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
makergo_c6_supermini.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native
